#!/usr/bin/env python
# coding: utf-8

# 1.__Реализовать игру__: Камень-Ножницы-Бумага-Ящерица-Спок
# __Правила игры__: Ножницы разрезают бумагу. Бумага накрывает камень. Камень бьет по ящерице.
# Ящерица выпускает яд в Спока. Спок разбивает ножницы.
# Ножницы отрезают голову ящерице. Ящерица съедает бумагу. Бумага опровергает Спока. Спок превращает камень в пар.
# И, как всегда, камень бьет по ножницам.
# __Действия игрока__: Ввести свое имя, ввести колличество игроков, выбрать жест(Камень-Ножницы-Бумага-Ящерица-Спок),
# наслаждаться игрой.
# __Дополнительные условия__: в игре могут учавствовать от 2-х до 9 человек. Вы должны играть против ботов.
# Игра на выбывание, победитель определяется когда остается только один, при ничье раунд повторяется.
# __После чего вывести статистику игры в виде__:
# Раунд 1    | вылетел игрок1, игрок5
# Раунд 2    | ничья
# Раунд 3    | вылетел игрок 2, игрок3
# Победитель | игрок4
#
# И предложение о том что бы сыграть еще.
#
#
# 2.__Усложнить__ реализованую игру Камень-Ножницы-Бумага-Ящерица-Спок до 101 элемента.
# (Надеюсь вы воспользовались ООП при решение первой задачи),
# при этом игроку перед вводом колличества игроков задается вопрос про колличество элементов в игре,
# где он может написать " нечетное целое число" от 3 до 101
#
# ![title](http://img0.joyreactor.cc/pics/comment/video-%D1%84%D0%B8%D0%BD%D0%B0%D0%BB-%D1%87%D0%B5%D0%BC%D0%BF%D0%B8%D0%BE%D0%BD%D0%B0%D1%82-%D0%BF%D0%BE-%D0%BA%D0%B0%D0%BC%D0%B5%D0%BD%D1%8C-%D0%BD%D0%BE%D0%B6%D0%BD%D0%B8%D1%86%D1%8B-2470604.jpeg)

